app/controllers/main_controller.rb

SELECT * FROM `orders` WHERE (`orders`.`id` = '2') LIMIT 1
---
  def order
    @order = Order.find_by_id(session[:order]) if session[:order] != nil

SELECT * FROM `orders` WHERE (`orders`.`id` = '12') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`name` = 'נכדו של הנוסע בזמן שהוא סבא של עצמו') LIMIT 1
---
  def add_pizza
    Pizza.new do |p|
      p.order = Order.find_by_id(params[:pizza][:order])
      p.user = User.find_by_name(params[:pizza][:user])

SELECT * FROM `pizzas` WHERE (`pizzas`.`id` = '4') LIMIT 1
DELETE FROM `pizzas` WHERE `id` = 4
---
  def delete_pizza
    pizza = Pizza.find_by_id(params[:id])
    pizza.destroy

SELECT * FROM `pizzas` WHERE (`pizzas`.`id` = '1') LIMIT 1
SELECT * FROM `toppings` WHERE (`toppings`.`name` = 'ללא') LIMIT 1
SELECT `toppings`.id FROM `toppings` INNER JOIN `pizzas_toppings` ON `toppings`.id = `pizzas_toppings`.topping_id WHERE (`toppings`.`id` = 1) AND (`pizzas_toppings`.pizza_id = 1 ) LIMIT 1
---
  def add_topping
    pizza = Pizza.find_by_id(params[:Pizza])
    topping = Topping.find_by_name(params[:Topping])
    pizza.toppings << topping unless pizza.toppings.include?(topping)

SELECT * FROM `pizzas` WHERE (`pizzas`.`id` = '1') LIMIT 1
SELECT * FROM `toppings` WHERE (`toppings`.`id` = '3') LIMIT 1
---
  def delete_topping
    pizza = Pizza.find_by_id(params[:id])
    topping = Topping.find_by_id(params[:topping])

SELECT * FROM `orders` WHERE (`orders`.`id` = '1') LIMIT 1
UPDATE `orders` SET `updated_at` = '2009-12-22 22:38:59', `active` = 1 WHERE `id` = 1
---
  def toggle_order_activity
    order = Order.find_by_id(params[:id])
    order.active = (not order.active)
    order.save